In [1]:
import pandas as pd

# Python Pandas

## Python Pandas (Data Series & Frames):

### Write a Python program to create and display a onedimensional array-like object containing an array of data using Pandas module.

In [2]:
oneD_array = pd.Series(["May","I","Know","You"],index = ['a','b','c','d'])
oneD_array

a     May
b       I
c    Know
d     You
dtype: object

### Write a Python program to convert a Panda module Series to Python list and its type

In [6]:
oneD_array = pd.Series(["May","I","Know","You"],index = ['a','b','c','d'])
print(oneD_array)
print(oneD_array.tolist())
print(type(oneD_array.tolist()))

a     May
b       I
c    Know
d     You
dtype: object
['May', 'I', 'Know', 'You']
<class 'list'>

### Write a Python program to add, subtract, multiple and divide two Pandas Series.

In [9]:
oneD_array1 = pd.Series([10,20,30,40],index = ['a','b','c','d'])
oneD_array2 = pd.Series([50,60,70,80],index = ['a','b','c','d'])
print("Adding of 2 Pandas Series")
print(oneD_array1+oneD_array2)
print("Subtraction of 2 Pandas Series")
print(oneD_array1-oneD_array2)
print("Multiplying of 2 Pandas Series")
print(oneD_array1*oneD_array2)
print("Dividing of 2 Pandas Series")
print(oneD_array1/oneD_array2)

Adding of 2 Pandas Series
a     60
b     80
c    100
d    120
dtype: int64
Subtraction of 2 Pandas Series
a   -40
b   -40
c   -40
d   -40
dtype: int64
Multiplying of 2 Pandas Series
a     500
b    1200
c    2100
d    3200
dtype: int64
Dividing of 2 Pandas Series
a    0.200000
b    0.333333
c    0.428571
d    0.500000
dtype: float64

### Write a Python program to compare the elements of the two Pandas Series

In [13]:
oneD_array1 = pd.Series([10,20,80,40],index = ['a','b','c','d'])
oneD_array2 = pd.Series([50,20,70,30],index = ['a','b','c','d'])

print("Comparision of 2 Pandas Series is oneD_array1 > oneD_array2 ")
print(oneD_array1 > oneD_array2)
print("Comparision of 2 Pandas Series is oneD_array1 < oneD_array2 ")
print(oneD_array1 < oneD_array2)
print("Comparision of 2 Pandas Series is oneD_array1 == oneD_array2 ")
print(oneD_array1 == oneD_array2)

Comparision of 2 Pandas Series is oneD_array1 > oneD_array2
a    False
b    False
c     True
d     True
dtype: bool
Comparision of 2 Pandas Series is oneD_array1 < oneD_array2
a     True
b    False
c    False
d    False
dtype: bool
Comparision of 2 Pandas Series is oneD_array1 == oneD_array2
a    False
b     True
c    False
d    False
dtype: bool

### Write a Python program to display the following data column wise.

In [21]:
students = pd.DataFrame({'id_number' : [204, 202, 264, 136, 238],
                               'Name' : ['James Smith',
                                        'Maria Rodriguez',
                                        'David Smith', 
                                        'Patricia Garcia',
                                        'Jessica Hernandez'],
                               'Age' : [26, 22 ,24, 21, 25],
                            'Gender' : ['M', 'F', 'M', 'F', 'F'],
                    
                        })
for index,values in students.items():
    print(index)
    print(values)

id_number
0    204
1    202
2    264
3    136
4    238
Name: id_number, dtype: int64
Name
0          James Smith
1      Maria Rodriguez
2          David Smith
3      Patricia Garcia
4    Jessica Hernandez
Name: Name, dtype: object
Age
0    26
1    22
2    24
3    21
4    25
Name: Age, dtype: int64
Gender
0    M
1    F
2    M
3    F
4    F
Name: Gender, dtype: object

### Write a Python program to create and display a Data Frame from a specified dictionary data which has the index labels

In [24]:
d = {'Manufacture_Year':[1990, 1994,1998, 2002],
    'Manufacture_Place' : ['Italy', 'USA', 'France', 'Japan'],
    'ITEM': ['BAG', 'Shoes', 'Pants', 'Shirt'],
    'COST' : [115, 141, 171, 161]}
pd.DataFrame(d)

   Manufacture_Year Manufacture_Place   ITEM  COST
0              1990             Italy    BAG   115
1              1994               USA  Shoes   141
2              1998            France  Pants   171
3              2002             Japan  Shirt   161

### Write a Python program to select the specified columns and rows from a given Data Frame.

In [30]:
d = {'Manufacture_Year':[1990, 1994,1998, 2002],
    'Manufacture_Place' : ['Italy', 'USA', 'France', 'Japan'],
    'ITEM': ['BAG', 'Shoes', 'Pants', 'Shirt'],
    'COST' : [115, 141, 171, 161]}
df = pd.DataFrame(d)
print(df)
df.loc[0:2,'Manufacture_Year':'ITEM']

   Manufacture_Year Manufacture_Place   ITEM  COST
0              1990             Italy    BAG   115
1              1994               USA  Shoes   141
2              1998            France  Pants   171
3              2002             Japan  Shirt   161

   Manufacture_Year Manufacture_Place   ITEM
0              1990             Italy    BAG
1              1994               USA  Shoes
2              1998            France  Pants

### Write a Python program to select the rows the score is between 15 and 20 (inclusive).

In [36]:
d = {'Score':[x for x in range(100)],
    'USERS' : ['User'+str(x) for x in range(100)]}
df = pd.DataFrame(d)
print(df.head())
df[(df["Score"] >= 15) & (df["Score"] <= 20)]

   Score  USERS
0      0  User0
1      1  User1
2      2  User2
3      3  User3
4      4  User4

    Score   USERS
15     15  User15
16     16  User16
17     17  User17
18     18  User18
19     19  User19
20     20  User20

### Write a Python program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [41]:
import random
d = {'Score':[x for x in range(100)],
    'USERS' : ['User'+str(x) for x in range(100)],
    'ATTEMPTS': [random.randint(1,10) for x in range(100)]}
df = pd.DataFrame(d)
print(df.head())
df[ (df["ATTEMPTS"] < 2) & (df["Score"] > 15)]

   Score  USERS  ATTEMPTS
0      0  User0         7
1      1  User1         1
2      2  User2        10
3      3  User3         9
4      4  User4         3

    Score   USERS  ATTEMPTS
20     20  User20         1
26     26  User26         1
27     27  User27         1
29     29  User29         1
38     38  User38         1
39     39  User39         1
54     54  User54         1
76     76  User76         1
77     77  User77         1
84     84  User84         1
86     86  User86         1
92     92  User92         1
94     94  User94         1

### Write a Python program to append a new row 'k' to Data Frame with given values for each column. Now delete the new row and return the original data frame.

In [60]:
d = {'Score':[random.randint(1,100) for x in range(10)],
    'USERS' : ['User'+str(x) for x in range(10)],
    'ATTEMPTS': [random.randint(1,10) for x in range(10)]}
df = pd.DataFrame(d)
print("BEFORE ADDING OF THE NEW USER")
print(df)
newrow = pd.Series([100,"TONY",1],index = ['Score','USERS','ATTEMPTS'] )
df = df.append(newrow, ignore_index=True)
print("AFTER ADDING OF THE NEW USER 'TONY' ")
print(df)
df = df.drop(df[df["USERS"] == "TONY"].index)
print("AFTER DELETE OF THE NEW USER")
print(df)

BEFORE ADDING OF THE NEW USER
   Score  USERS  ATTEMPTS
0     88  User0        10
1     96  User1         1
2     69  User2        10
3     34  User3         3
4     40  User4         3
5     76  User5         6
6     56  User6        10
7     61  User7         9
8     28  User8         3
9     15  User9         4
AFTER ADDING OF THE NEW USER 'TONY'
    Score  USERS  ATTEMPTS
0      88  User0        10
1      96  User1         1
2      69  User2        10
3      34  User3         3
4      40  User4         3
5      76  User5         6
6      56  User6        10
7      61  User7         9
8      28  User8         3
9      15  User9         4
10    100   TONY         1
AFTER DELETE OF THE NEW USER
   Score  USERS  ATTEMPTS
0     88  User0        10
1     96  User1         1
2     69  User2        10
3     34  User3         3
4     40  User4         3
5     76  User5         6
6     56  User6        10
7     61  User7         9
8     28  User8         3
9     15  User9         4

### Write a Python program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order.

In [73]:
d = {'Score':[random.randint(1,100) for x in range(10)],
    'USERS' : ['User'+str(random.randint(1,10)) for x in range(10)],
    'ATTEMPTS': [random.randint(1,10) for x in range(10)]}
df = pd.DataFrame(d)
print(df)
df.sort_values(by = ['USERS','Score'])

   Score   USERS  ATTEMPTS
0     89   User9         8
1     45   User7         1
2     88  User10        10
3     35  User10         8
4     96   User2         9
5     92   User4         5
6     23   User8         8
7     95   User1         4
8     19   User2         3
9     51   User1         4

   Score   USERS  ATTEMPTS
9     51   User1         4
7     95   User1         4
3     35  User10         8
2     88  User10        10
8     19   User2         3
4     96   User2         9
5     92   User4         5
1     45   User7         1
6     23   User8         8
0     89   User9         8

### Write a Python program to insert a new column in existing Data Frame.

In [63]:
d = {'Score':[random.randint(1,100) for x in range(10)],
    'USERS' : ['User'+str(x) for x in range(10)],
    'ATTEMPTS': [random.randint(1,10) for x in range(10)]}
df = pd.DataFrame(d)
print(df)
df["GRADE"] = "unknown"
df

   Score  USERS  ATTEMPTS
0     14  User0         6
1     12  User1         2
2     29  User2         4
3     58  User3         4
4     43  User4         8
5     58  User5         2
6     69  User6         9
7     37  User7         1
8      7  User8         6
9     74  User9         1

   Score  USERS  ATTEMPTS    GRADE
0     14  User0         6  unknown
1     12  User1         2  unknown
2     29  User2         4  unknown
3     58  User3         4  unknown
4     43  User4         8  unknown
5     58  User5         2  unknown
6     69  User6         9  unknown
7     37  User7         1  unknown
8      7  User8         6  unknown
9     74  User9         1  unknown

### Write a Python program to change the name 'James' to 'Suresh' in name column of the data frame.

In [70]:
d = {'Score':[random.randint(1,100) for x in range(10)],
    'USERS' : ['User'+str(x) for x in range(10)],
    'ATTEMPTS': [random.randint(1,10) for x in range(10)]}
df = pd.DataFrame(d)
newrow = pd.Series([100,"James",1],index = ['Score','USERS','ATTEMPTS'] )
df = df.append(newrow, ignore_index=True)
print("Before Changing the Name")
print(df)
df.loc[df["USERS"] == "James","USERS"] = "Suresh"
print("After Changing the Name")
df

Before Changing the Name
    Score  USERS  ATTEMPTS
0      72  User0         1
1      40  User1         6
2      92  User2         5
3      18  User3         7
4      47  User4         9
5      32  User5         5
6      73  User6         5
7       7  User7         3
8       9  User8         4
9      22  User9         3
10    100  James         1
After Changing the Name

    Score   USERS  ATTEMPTS
0      72   User0         1
1      40   User1         6
2      92   User2         5
3      18   User3         7
4      47   User4         9
5      32   User5         5
6      73   User6         5
7       7   User7         3
8       9   User8         4
9      22   User9         3
10    100  Suresh         1